
## Plan Result (dev)

[CI link](https://github.com/iret-h-ota/tfaction-sample/actions/runs/12557019291)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network_apne3.module.vpc.aws_route_table_association.private[0]
  * module.network_apne3.module.vpc.aws_route_table_association.private[1]
  * module.network_apne3.module.vpc.aws_route_table_association.private[2]
  * module.network_apne3.module.vpc.aws_subnet.private[0]
  * module.network_apne3.module.vpc.aws_subnet.private[1]
  * module.network_apne3.module.vpc.aws_subnet.private[2]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network_apne3.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-08fb4c34b8a47393f"
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-08fb4c34b8a47393f"
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-08fb4c34b8a47393f"
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-a"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-a"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = "vpc-09d28d76f76a0ae86"
    }

  # module.network_apne3.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-b"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-b"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = "vpc-09d28d76f76a0ae86"
    }

  # module.network_apne3.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-c"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-c"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = "vpc-09d28d76f76a0ae86"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"280eca94f33faeae2e8df71017d8d00599f6f2be","Target":"dev","Vars":{},"WorkflowName":"CI"} -->